第6章/project/jmeter/plan/shopping_flow.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="shopping_flow" enabled="true">
      <stringProp name="TestPlan.comments">sketch-store 8 步链路：商品列表→登录→加购→查车→预览→建单→支付→查单
关联点：登录 token、预览 orderId
参数化：users.csv / goods.csv
场景：基准/容量/稳定性/异常/压力/配置（全部外部变量注入）</stringProp>
    </TestPlan>
    <hashTree>
      <!-- 线程组：外部变量注入 -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="shopping_flow_vus" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanelGui" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(loops,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(vus,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp,30)}</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,180)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- HTTP Request Defaults -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,8000)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">${__P(conn_timeout,5000)}</stringProp>
          <stringProp name="HTTPSampler.response_timeout">${__P(resp_timeout,30000)}</stringProp>
        </ConfigTestElement>
        <hashTree>
          <!-- HTTP Header Manager：公共头 + 压测标记 -->
          <HeaderManager guiclass="HeaderPanelGui" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept-Encoding</stringProp>
                <stringProp name="Header.value">gzip, deflate</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">dunshan</stringProp>
                <stringProp name="Header.value">7DGroup</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">User-Agent</stringProp>
                <stringProp name="Header.value">Replayed-by-Gor</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- CSV Data Set Config：users.csv -->
          <CSVDataSet guiclass="CSVDataSetGui" testclass="CSVDataSet" testname="CSV Data Set Config - Users" enabled="true">
            <stringProp name="filename">data/users.csv</stringProp>
            <stringProp name="variableNames">userId,password</stringProp>
            <stringProp name="delimiter">,</stringProp>
            <boolProp name="recycle">true</boolProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="sharingMode">all</stringProp>
          </CSVDataSet>
          <hashTree/>
          <!-- CSV Data Set Config：goods.csv -->
          <CSVDataSet guiclass="CSVDataSetGui" testclass="CSVDataSet" testname="CSV Data Set Config - Goods" enabled="true">
            <stringProp name="filename">data/goods.csv</stringProp>
            <stringProp name="variableNames">goodsId</stringProp>
            <stringProp name="delimiter">,</stringProp>
            <boolProp name="recycle">true</boolProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="sharingMode">all</stringProp>
          </CSVDataSet>
          <hashTree/>
          <!-- Cookie Manager：维持会话 -->
          <CookieManager guiclass="CookiePanelGui" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
            <collectionProp name="CookieManager.cookies"/>
            <stringProp name="CookieManager.policy">compatibility</stringProp>
          </CookieManager>
          <hashTree/>
        </hashTree>
        <!-- 1. 商品列表 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="1-商品列表" enabled="true">
          <stringProp name="HTTPSampler.path">/api/goods/list</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="page" elementType="HTTPArgument">
                <stringProp name="Argument.name">page</stringProp>
                <stringProp name="Argument.value">1</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
              <elementProp name="size" elementType="HTTPArgument">
                <stringProp name="Argument.name">size</stringProp>
                <stringProp name="Argument.value">20</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="商品列表断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 2. 登录取 token -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="2-登录-取token" enabled="true">
          <stringProp name="HTTPSampler.path">/api/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.body">{"username":"${userId}","password":"${password}"}</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- JSON Extractor: token -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - token" enabled="true">
            <boolProp name="JSONPostProcessor.use_names">true</boolProp>
            <stringProp name="JSONPostProcessor.names">token</stringProp>
            <stringProp name="JSONPostProcessor.exprs">$.data.token</stringProp>
            <stringProp name="JSONPostProcessor.match_nums">1</stringProp>
            <stringProp name="JSONPostProcessor.defaults">NOT_FOUND</stringProp>
            <stringProp name="JSONPostProcessor.apply_to">both</stringProp>
            <boolProp name="JSONPostProcessor.compute_concurrency">true</boolProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="登录断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">0</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- Authorization Header 注入（线程级） -->
        <HeaderManager guiclass="HeaderPanelGui" testclass="HeaderManager" testname="Authorization Header" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${token}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <!-- 3. 加购 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="3-加购" enabled="true">
          <stringProp name="HTTPSampler.path">/api/cart/add</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.body">{"goods_id":"${goodsId}","num":${__Random(1,5)}}</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="加购断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">0</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 4. 查购物车 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="4-查购物车" enabled="true">
          <stringProp name="HTTPSampler.path">/api/cart/list</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="查购物车断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">0</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 5. 预览单 → 提取 orderId -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="5-预览单-取orderId" enabled="true">
          <stringProp name="HTTPSampler.path">/api/order/preview</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.body">{}</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- JSON Extractor: orderId -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - orderId" enabled="true">
            <boolProp name="JSONPostProcessor.use_names">true</boolProp>
            <stringProp name="JSONPostProcessor.names">orderId</stringProp>
            <stringProp name="JSONPostProcessor.exprs">$.data.order_id</stringProp>
            <stringProp name="JSONPostProcessor.match_nums">1</stringProp>
            <stringProp name="JSONPostProcessor.defaults">NOT_FOUND</stringProp>
            <stringProp name="JSONPostProcessor.apply_to">both</stringProp>
            <boolProp name="JSONPostProcessor.compute_concurrency">true</boolProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="预览单断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">0</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 6. 建单 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="6-建单" enabled="true">
          <stringProp name="HTTPSampler.path">/api/order/create</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.body">{"order_id":"${orderId}"}</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="建单断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">0</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 7. 支付（幂等 request_id） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="7-支付" enabled="true">
          <stringProp name="HTTPSampler.path">/api/order/pay</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.body">{"order_id":"${orderId}","pay_type":"mock","request_id":"pay-${__threadNum}-${__time(yyyyMMddHHmmssSSS)}"}</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="支付断言" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">0</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 8. 查单（最终业务状态 PAID） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="8-查单" enabled="true">
          <stringProp name="HTTPSampler.path">/api/order/${orderId}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="ArgumentsPanelGui" testclass="Arguments" enabled="true"/>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="查单断言-PAID" enabled="true">
            <collectionProp name="Assertion.test_strings">
              <stringProp name="46693">PAID</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.json_path</stringProp>
            <stringProp name="Assertion.json_path">$.data.status</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <!-- 结果收集 -->
        <ResultCollector guiclass="SummaryReportGui" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <objProp name="ResultCollector.save_config">
            <SampleSaveConfiguration>
              <boolProp name="saveOutput">true</boolProp>
              <boolProp name="saveResponseData">false</boolProp>
              <boolProp name="saveSamplerData">false</boolProp>
              <boolProp name="saveRequestHeaders">true</boolProp>
              <boolProp name="saveResponseHeaders">true</boolProp>
              <boolProp name="saveAssertionResultsFailureMessage">true</boolProp>
            </SampleSaveConfiguration>
          </objProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizerGui" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>